Tekla Open API Reference for Tekla Structures 2025
ModelObjectVisualization.GetTempRepresentation Method
 Gets the temporary representation (red, blue, green and transparency) of given model object
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Color GetTempRepresentation(
	ModelObject modelObject
)
Public Shared Function GetTempRepresentation (
	modelObject As ModelObject
) As Color
Parameters
modelObject
Type: Tekla.Structures.Model.ModelObject
The model object to check.
Return Value
Type: Color
The temporary representation or null if not set.
See Also
Reference
ModelObjectVisualization Class
Tekla.Structures.Model.UI Namespace